{"html":"<p>Fuzzy Logic is another use-case to be good at by design. Then, a degenerate case it is also good at it boolean and ternary logic.</p>\n<p>Perhaps some implementation detail would be something like the following:</p>\n<pre class='language-javascriptreact'><code>alias truthiness byte [\n    alias always-<span class=\"hljs-literal\">true</span> <span class=\"hljs-number\">0xFF</span>\n    alias always-<span class=\"hljs-literal\">false</span> <span class=\"hljs-number\">0x00</span>\n    valid-value range <span class=\"hljs-number\">0x00</span>.<span class=\"hljs-number\">.0</span>xFF\n    value [ <span class=\"hljs-keyword\">default</span> <span class=\"hljs-number\">0x00</span> ]\n]</code></pre><p>(Sidenote: &#39;Truthiness&#39; is a word defined from the Stephen Colbert show. Perhaps not a final keyword for Anonlang.)</p>\n<p>Naive person: 128 different values should be more than enough range for good-enough fuzziness.</p>\n<p>Currently, I&#39;m one of those naive people for this. But, I imagine the future will have more things better defined, and where safety and decimal places are very important may want to have more room to play in, like for airplanes. So, implementation would actually be a <code>byte-group</code> with default size of one byte.</p>\n<p>One possible complication for this would be a variable &#39;always-true&#39; value. So, one possible way to prevent that complication would be to have a fixed byte-group size (perhaps, per alias). Another possible idea is to not define a &#39;always-true&#39; and &#39;always-false&#39; because other fuzzy rules should automatically handle those cases anyways.</p>\n<p>Sudden thought: &#39;Fuzzy Logic&#39; programming languages are creations of DSL for declarative form.</p>\n<p>Another possible way to fix the potential issue of defined fuzzy keywords is to make sure that translated values are always between &#39;0&#39; and &#39;1&#39;. This would only be for when needing to multiply against other numbers to get a result for a situation. Since backed by a byte-group, the value would have to be equivalent to regular value divided by max value with all bytes set to one. Then, definitions of &#39;false&#39; and &#39;true&#39; wouldn&#39;t change.</p>\n","title":"Fuzzy Logic","file":"2015-09-21-fuzzy-logic.md","date":"2015-09-21","slug":"2015-09-21-fuzzy-logic"}