{"html":"<p>(For easier writing of this section, I will use refer to functions and methods as to just functions. (Abstraction for the win!))</p>\n<p>Here&#39;s a thought: let&#39;s not have to write the boilerplate for every function (and method) and field that we want to create.</p>\n<p>Here&#39;s a crazier thought: when writing code, let&#39;s not have to differentiate between whether we are writing a function or field.</p>\n<p>We don&#39;t need to define whether something is a function or field. They both (optionally) return a value and have zero or more arguments (traditional fields are always zero arguments).</p>\n<p>As an example, I will write the same (trivial) code in Java and &quot;Anonlang&quot; where the only difference is the one idea talked about in this section, meaning not the final ideal Anonlang. (And, I just threw in a &quot;readable&quot; modifier just so that we can experiment with that idea. Perhaps something more granular like unix file security model would be better? But, that&#39;s for a different section)</p>\n<pre class='language-javascriptreact'><code><span class=\"hljs-class\"><span class=\"hljs-keyword\">class</span> <span class=\"hljs-title\">MyJavaClass</span> </span>{\n    private int key;\n    private <span class=\"hljs-built_in\">String</span> value;\n    public boolean isSet;\n    public MyJavaClass(int key, <span class=\"hljs-built_in\">String</span> value) { <span class=\"hljs-keyword\">this</span>.key = key; <span class=\"hljs-keyword\">this</span>.value = value; }\n    public int getKey() { <span class=\"hljs-keyword\">return</span> key; }\n    public <span class=\"hljs-built_in\">String</span> getValue() { <span class=\"hljs-keyword\">return</span> value; }\n}\n\nMyAnonlangClass(int key, <span class=\"hljs-built_in\">String</span> value) {\n<span class=\"hljs-comment\">//MyAnonlangClass(readables) { // Random idea for no duplication.</span>\n    readable int key;\n    readable <span class=\"hljs-built_in\">String</span> value;\n    shared boolean isSet;\n}</code></pre><p>For this contrived example, to refactor Java to make <code>isSet</code> private, you must create a new method and change how all other objects interact with the class. The ideal refactoring would involve just changing the <code>shared boolean isSet</code> line to something like:</p>\n<pre class='language-javascriptreact'><code>shared boolean isSet {\n    <span class=\"hljs-keyword\">return</span> key != <span class=\"hljs-number\">0</span> &amp;&amp; value.isNotEmpty;\n    <span class=\"hljs-comment\">//return key &amp;&amp; value; // Random experimental idea because all objects have a natural \"false\" state that could be exploited.</span>\n}</code></pre><p>Thus, not having to refactor anywhere else that was already pointing to the <code>isSet</code> field-now-method.</p>\n<p>Pros:</p>\n<ul>\n<li>Changing implementation details without changing the public API (and without the boilerplate)</li>\n<li>Provide a way to encourage more lazy loading</li>\n<li>Write less code and more readable</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>At a quick glance in a regular text editor, you may not know if the attribute (aka function/field) should be read from or written to. Workaround: Basic tooling can prevent you from doing the wrong thing at edit-time.</li>\n<li>The program wouldn&#39;t know when something had to be just calculated once or every time. Fix: There could likely be a property attribute for that. Perhaps, even allow dynamic programming by default or calculating once per specified time-length. Or, maybe, even the compiler and/or runtime environment would be able to figure that out automatically and apply the proper operation (if not explicitly set by dev).</li>\n</ul>\n<p>Designing the ideal language takes time and different perspectives. Feel free to input more ideas related to combining the functions and fields. What other pros and cons are there?</p>\n<p><small>ps - The &quot;Anonlang&quot; syntax shown is not the final one. For purposes of this section, it was just kept similar to the compared language so that more people would quickly understand it. These other syntax changes will be discussed in other sections.</small></p>\n","title":"Better Functions, Methods, and Fields","file":"2015-03-21-better-functions-methods-fields.md","date":"2015-03-21","slug":"2015-03-21-better-functions-methods-fields"}