{"html":"<p>In previous posts, when I mentioned &quot;linear algebra&quot; and &quot;applying&quot; one scope to another, I always should the syntax as <code>[one-thing] * [another]</code>. While that particular &#39;multiplication sign&#39; may have some inherent meaning, another idea occurred that should at least be considered.</p>\n<p>What about the &#39;dot operator&#39;?</p>\n<p>In linear algebra and other higher-ish level of mathematics, the dot operator is used to show multiplication (when a symbol is needed to disambiguate). So, would it be possible to use the syntax of &#39;[one-thing] . [another]`?</p>\n<p>That reason, and because it doesn&#39;t require the shift-key are the two main reasons that brought me here to think about it more...</p>\n<p>What is the &#39;dot operator&#39; currently used for?</p>\n<p>In some languages, it is a (numerical) decimal separator (or grouping separator). More importantly it is typically used to access member attributes of an object or class. And, in some languages, it is used as a String append (as opposed to a plus sign). In mathematics, it could be multiplication or &quot;dot product&quot; or sometimes projections and sets.</p>\n<p>(Sidenote: I&#39;m really curious why that is (the different append operator). So, looks like <a href=\"https://stackoverflow.com/questions/1866098/why-a-full-stop-and-not-a-plus-symbol-for-string-concatenation-in-php\">some great</a> <a href=\"https://stackoverflow.com/questions/4266799/why-is-the-php-string-concatenation-operator-a-dot\">SO answers</a>. I will do a non-bias breakdown comparison later. It seems many people have been biases and pre-conditioned towards how &quot;+&quot; works from first languages. Feel free to remind me that I haven&#39;t done this non-bias multi-perspective report yet. Update: Here&#39;s a quick idea: we can get rid of the problem entirely with String concats.)</p>\n<p>Continuing past the specific operator implementation detail, basically, we can try to think of a way to blur the lines more between code and data, placeholders and values, and more. This will likely tie in more with the \n<a href=\"./anonlang/2015-08-18-pattern-mvc\">&quot;Pattern: MVP&quot; article</a>.</p>\n","title":"Syntax: Matrix Multiplication","file":"2015-08-18-syntax-matrix-multiplication.md","date":"2015-08-18","slug":"2015-08-18-syntax-matrix-multiplication"}