{"html":"<p>In an effort to question all assumptions about programming languages, I&#39;m surprised that it&#39;s taken me this long to think about array numbering. How should the first index be accessed?</p>\n<p>Those new to programming would access the first element in a list with &#39;1&#39;, because that it the natural counting for pointing to the first &#39;thing&#39;.</p>\n<p>Those that have been programming for awhile tend to say that using &#39;0&#39; is most natural.</p>\n<p>I&#39;ve talked to multiple people and read through a few different forums to be sure of this case. Unfortunately, the way most of the &#39;pro-0-based&#39; people talk about it, they have big holes in their &#39;reasons&#39;. I&#39;d be happy to discuss any of the specific pro-0-based reasons and their flaws. Though, at this time I&#39;m not going to make a list of them and how the reasons are mis-guided because it doesn&#39;t seem worth my time now. And, as far as I know, the pro-1-based side only has one argument -- that it is most natural to think that way and that&#39;s how people would think before knowing implementation details of compilers.</p>\n<p><strong>There is a big misconception that both sides have: They are not using the same meaning of &#39;index&#39;.</strong></p>\n<p>&#39;C&#39;-languages have an &#39;index&#39; for their arrays, but what they really mean is &#39;offset&#39;. It is the offset of the array reference that simplifies some array operations.</p>\n<p>When people mention a one-based index, they are choosing to not worry about the implementation details of pointers and references.</p>\n<p>Note: Cutting this post short due to time. I will maybe revisit later. Currently, haven&#39;t decided one way or another. Here&#39;s more topics to read before posting more:</p>\n<ul>\n<li><a href=\"http://www.cs.utexas.edu/users/EWD/transcriptions/EWD08xx/EWD831.html\">http://www.cs.utexas.edu/users/EWD/transcriptions/EWD08xx/EWD831.html</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Zero-based_numbering\">https://en.wikipedia.org/wiki/Zero-based_numbering</a></li>\n</ul>\n","title":"Zero-Based Arrays vs One-Based Arrays","file":"2015-09-05-zero-based-array-vs-one-based-array.md","date":"2015-09-05","slug":"2015-09-05-zero-based-array-vs-one-based-array"}