{"html":"<p>In order for Anonlang to have more of the ability to replace anything easily, there must be some templating language aspect to it.</p>\n<p>Currently, the only templating language that I know off that top of my head is &#39;Liquid&#39;, which I have used for my Jekyll/Ruby blog. So, I&#39;ll eventually have to learn more of then to see if there are already some great standards and ideas out there.</p>\n<p>Liquid template system defines a replaceable block as <code>{% Do something here %}</code>, which allows for Ruby code within a markup language.</p>\n<p>One proposed idea for Anonlang templates is the double bracket <code>[[ D something here ]]</code> because that doesn&#39;t seem to be used yet and can possibly clearly stand out. Something not fully thought of yet is how it will interact with brackets for non-templates, perhaps the first double will start and leave alone all the next opening ones until the double-closing-brackets. Possible fallbacks of this particular syntax include making sure that a scope within a scope aren&#39;t recognized as a template. Currently defined rules haven&#39;t ruled out the possibility of an unnamed scope as the first item in another scope. And, that means same would go for a triple-bracket syntax for Anonlang templates and unnamed-scope within unnamed-scope within scope.</p>\n<p>Before introducing another idea, first a little tangent for other &#39;defined rules&#39; for Anonlang:</p>\n<ul>\n<li>Use of [ Do something here ] for regular/any scope</li>\n<li>Use of [&#39; Do something here &#39;] for a string scope</li>\n<li>Use of [` Do something here `] for a code scope</li>\n<li>Use of [; Do something here ;] for a comment scope</li>\n</ul>\n<p>So, would it be possible to have another &#39;simple&#39; typed scope that kinda makes sense?</p>\n<p>For a non-biased person, is there a symbol that could easily mean &#39;insert&#39; or &#39;replace&#39; or &#39;template&#39;?</p>\n<p>One idea based on that thought is that putting a specific letter/word right after the opening scope character to define what it is for, then another benefit would be a lot more options, and users possibly being able to define their own options also (though maybe not if it would get too confusing). For example: <code>[i insert mode i]</code>, or maybe even double bracket if necessary to distinguish easier at a glance.</p>\n<p>As for possible symbols to use with the opening bracket to define the type, still (non-shift) available are forward-slash, back-slash, comma, dash, equals, and period. Now, just a quick visual glance for how it may look:</p>\n<pre>\n[-    -]\n[=    =]\n[\\    \\]\n[/    /]\n[.    .]\n[,    ,]\n</pre>\n\n<p>Hmmm, one fallback of these is that they are starting to get further away from the home keys and more awkward to press. Perhaps spending some more time with Vim will provide more thoughts about staying on home row. Though, to narrow down the current options based on efficiency, the equals-sign, comma, and period seem to be the more fluid to type. Equals could be good for meaning &#39;replace&#39; and &#39;assignment&#39; of the scope. One fallback may be too many equals signs all around? More experiments in writing code in this regard are needed.</p>\n","title":"As a templating language","file":"2015-08-21-as-a-templating-language.md","date":"2015-08-21","slug":"2015-08-21-as-a-templating-language"}