{"html":"<p>The current popular visibility modifiers are <code>private</code>, <code>private-package</code>, <code>protected</code>, and <code>public</code>.</p>\n<p>What&#39;s wrong? What&#39;s right? What can be done better? Are there better names to use that would help the understanding of new programmers? Why do they all start with &quot;p&quot;? What&#39;s the right default?</p>\n<p>One thing to note is that when you are reading or working with others&#39; code, you want to know for sure if the developer meant to create that public API or was it just because it was the system default (and may be removed in the future). So, the default visibility should be as limiting as possible.</p>\n<p>The use-cases for the current popular visibility modifiers seem to be good, right? It seemed to worked for the past few decades. But, before getting to that, let&#39;s quickly mention the extremes for the visibility modifiers.</p>\n<p>Everything &quot;private&quot; or not shared from a Class? Probably not good for large projects. This means only one class would ever be available because two different classes wouldn&#39;t be able to communicate with each other. And, classes are nice to have to organize code into more manageable abstractions.</p>\n<p>Everything &quot;public&quot; or globally accessible in a Class? This would complicate refactoring. A common reason to &quot;hide&quot; certain code from public API is so that the implementation details can change without the API user having to worry about it.</p>\n<p>What if we had to individually define the visibility for every single other class in our project? If not that, then what about for all packages? Perhaps define the visibility for all users or API implementers? Maybe at a level for &quot;end-dev-user&quot; and &quot;framework-dev&quot;?</p>\n<p>Still more to write...</p>\n<p>This is mainly a deep dive into even the most &quot;trivial&quot; things. We have time to make sure we understand everything, the reasons for them, and to explore new possibilities.</p>\n","title":"Exploring Possible Visibility Modifier for the Ideal Language to the Extreme","file":"2015-03-25-exploring-possible-visibility-modifier.md","date":"2015-03-25","slug":"2015-03-25-exploring-possible-visibility-modifier"}