{"html":"<p>Originally, I was thinking about making an adapter to convert between Anonlang to something like Java&#39;a <code>LinkedHashMap</code>, which does seem to fix the scope of features that I&#39;m looking for in an easy manner.</p>\n<p>Another idea is to forgo the traditional data structure idea. I&#39;m sure this has been subconscious in my mind for awhile. And, more of it still is. The basic idea is that the format as written would be the data structure and wouldn&#39;t need to be converted into anything else to be used directly. Though, since large paradigms are hard to break habit/thought, the old paradigm metaphor could be very roughly similar to that of a <code>String</code> (program as typed by dev) and it would be containing self-pointers/references to the other &quot;String&quot; parts it holds.</p>\n<p>In this case, if Anonlang were considered more as a &quot;markup&quot; language, then it&#39;d be more possible to avoid the initial pass-through and parsing of converting to the (possible) large LinkedHashMap (or similar). Things at first my be all lazy-loaded. If also doing lazy-(functional)-work, then possibly more cycles could be saved.</p>\n<p>Sidenote: Every now and then, I may mention something that may seem to allude to &quot;performance&quot;, but this isn&#39;t particularly the main concern for now. It might just be talked about at very high level, just noting that it wouldn&#39;t be performant (mainly when compared to a traditional language). There are many parts of this language that are ahead of its time. And, exact implementation details can be figured out latter and changed if necessary. At this time more focus is going into the overall architecture and larger goal-views.</p>\n<p>Update: When re-visiting Google&#39;s cross-platform &#39;<a href=\"https://github.com/google/flatbuffers\">FlatBuffers</a>&#39;, it seems that would be the similar style for &#39;parsing&#39; this language also. It is some great and clever work.</p>\n","title":"Implementation","file":"2015-08-18-implementation.md","date":"2015-08-18","slug":"2015-08-18-implementation"}