{"html":"<p>Challenge: Make simpler scoping rules that are still both human and computer parse-able.</p>\n<p>I&#39;m not saying that the current &#39;traditional&#39; style is bad or hard. I&#39;m quite used to it. But, we can at least try to think of possible alternatives.</p>\n<p>Though experiment: Is it possible to only use square brackets in a language and not have to use either the curly brace or parenthesis?</p>\n<p>Here&#39;s just a few possible ideas for the above thought experiment:</p>\n<p>&#39;traditional&#39;:</p>\n<pre class='language-javascriptreact'><code><span class=\"hljs-function\"><span class=\"hljs-keyword\">function</span> <span class=\"hljs-title\">myFunctionName</span> (<span class=\"hljs-params\">int aInt, String aString</span>) </span>{ <span class=\"hljs-comment\">/* Do something in scope with arguments */</span> }\n\n<span class=\"hljs-keyword\">while</span> (i &lt; length) { <span class=\"hljs-comment\">/* Do something */</span> }</code></pre><p>Semantically same (for theoretical language):</p>\n<pre class='language-javascriptreact'><code>[<span class=\"hljs-string\">`int aInt, String aString`</span> [; Do something <span class=\"hljs-keyword\">in</span> scope <span class=\"hljs-keyword\">with</span> argument;] ]\n\n[<span class=\"hljs-string\">`i &lt; length`</span> [; Do something ;] :]</code></pre><p>Hmm, this challenge may have been too easy. We may just have to look at Lisp to see everything being done with parenthesis. It seems that I may have stumbled upon some same ideas that original Lisp creators had. On that note, same with functional elements, like in Haskell. And, this is all still being attempted to have ideas from scratch with reasons for each step of the way other than &#39;other languages do it, so I should too&#39;.</p>\n<p>One difference with Lisp for this theoretical language is that Lisp has the function name inside the &#39;scope&#39;. For Anonlang, items declared within scopes would only be available within that scope, so the function name would have to be on the outside. Also, &#39;function name&#39; would just be an &#39;alias&#39; for the &#39;named&#39; scope.. to use terms that might be more &#39;technical&#39; in the language.</p>\n<p>Random thought now: Every scope is a for-loop in disguise? Ex: [<code>int i = 0; i &lt; length; i++</code> [; Do something ;] ]</p>\n<p>Then, parts of the &#39;for-loop&#39; could just be left out when wanting to do other things. Leaving out last two &#39;for-loop-argument` seems like it could create the function being called one with an (optional) parameter. It seems that there are no differences between a regular no-arg function and for-loop that is only ran through once... This could quite possibly simplify Anonlang code...</p>\n","title":"Syntax: Scope","file":"2015-08-19-syntax-scope.md","date":"2015-08-19","slug":"2015-08-19-syntax-scope"}