{"html":"<p>This should be a really short post. There&#39;s not many possible ways of casting data types, right? So, in no particular order:</p>\n<ul>\n<li><code>str(42)</code></li>\n<li><code>42.toString()</code></li>\n<li><code>(String) 42</code></li>\n<li><code>42 as string</code></li>\n<li>(implicit) <code>42</code></li>\n</ul>\n<p>We probably can&#39;t do much better than these ideas above. But, we <em>can</em> think about which option is the most intuitive for new programmers, and which syntax would fit well with the rest of the language, and which syntax is open enough for many other conversion types (including custom classes)</p>\n<h3 id=\"re-str42\">Re: <code>str(42)</code></h3>\n<p>The String type is the most commonly used data type, so it would make sense to simplify its usage. The 3-letter lower-case abbreviation is memorable enough after a few uses. Even though Python has <code>str()</code> as a built-in standard method, programmers can have the same syntax with overloaded constructors in their custom classes, i.e., <code>MyClass(...)</code>. Unfortunately, one way that the built-in syntax is different than the custom syntax is that the built-in syntaxes are all lower-case and the classes are all starting with upper-case. Also, is the &#39;str&#39; abbreviation better than just having a &#39;text&#39; data type instead of &#39;string&#39; data type?</p>\n<h3 id=\"re-42tostring\">Re: <code>42.toString()</code></h3>\n<p>Languages using this syntax either can&#39;t use the same syntax to convert from built-in data types to custom data types (classes), OR they have the concept of extension methods, which I really like having. With this syntax, IDEs could easily have auto-complete and suggestion for all possible conversions by doing <code>.to&lt;ctrl+space&gt;</code>.</p>\n<h4 id=\"re-42str\">Re: <code>42.str</code></h4>\n<p>This is a degenerative form of <code>42.toString()</code>.</p>\n<p>I did consider a version of this syntax for a little bit, but when working on a few more examples later in this post, I figured this syntax wouldn&#39;t be as intuitive or obvious in some cases, for example: <code>day.seconds</code> would be ambiguous. It could mean getting the seconds out of the day rather than converting the full day to seconds. We would want to reserve this syntax for easily getting properties of an object rather than converting.</p>\n<h3 id=\"re-string-42\">Re: <code>(String) 42</code></h3>\n<p>This option creates a brand new syntax just for casting. Instead of choosing this less intuitive route, let&#39;s see if we can re-use existing syntax to handle this data type conversion requirement. (Answer: Yes, we can)</p>\n<h3 id=\"re-42-as-string\">Re: <code>42 as string</code></h3>\n<p>I kind of liked how this syntax read, including <code>42 to String</code>. But, since I just complained about creating a new syntax for casting in the previous section. I&#39;ll hold off on this one for now. </p>\n<h3 id=\"re-implicit-42\">Re: (implicit) <code>42</code></h3>\n<p>Personally, I prefer explicit syntax in order to avoid simple mistakes.</p>\n<h2 id=\"summary\">Summary</h2>\n<p>Currently, my top two choices for data type casting is <code>.toString()</code> and the more &#39;English&#39; version of that <code>to String</code>.</p>\n<p>Now, let&#39;s just list a few more examples to see these two syntax in action:</p>\n<pre class='language-javascriptreact'><code>days <span class=\"hljs-keyword\">as</span> seconds\ndays to seconds\ndays.toSeconds()\n\nhours <span class=\"hljs-keyword\">as</span> days\nhours to days\nhours.toDays()\n\nkm <span class=\"hljs-keyword\">as</span> m\nkm to m\nkm.toM()\n\nnumber <span class=\"hljs-keyword\">as</span> integer <span class=\"hljs-keyword\">as</span> text\nnumber to integer to text\nnumber.toInteger().toText()\n\nnumber to Integer to <span class=\"hljs-built_in\">String</span> to uppercase\nnumber.toInteger().toString().toUpperCase()</code></pre><p>From this little exercise, I realized that I like &#39;to&#39; better than &#39;as&#39; because a common conversion phrase in English is &#39;convert from _ to _&#39;. Also, it just felt more comfortable (and faster) writing only text, compared to writing text and a period and two parentheses.</p>\n<p>One downside to using the stand-alone &#39;to&#39; may be for method chaining. The operator precedence is not immediately obvious in some cases. And, it&#39;s not immediately obvious to me which method I would have to update in order for the stand-alone &#39;to&#39; syntax to work.</p>\n","title":"Data Type Conversion Syntax","file":"2020-03-01-data-type-conversion-syntax.md","date":"2020-03-01","slug":"2020-03-01-data-type-conversion-syntax"}