{"html":"<p>Today, I went on a longer run compared to the run a few days ago. This run felt much easier. Possible reasons:</p>\n<ol>\n<li>My body was more ready for it because of the prior run.</li>\n<li>I was just more zoned out this run, thinking less compared to the last run.</li>\n<li>I remembered more strategies that helps with running:<ol>\n<li>Take optimal strides.</li>\n<li>Use other muscles more.</li>\n<li>Take better steps.</li>\n</ol>\n</li>\n</ol>\n<p>(Tangent: Another possible reason is that this run, even though generally colder out, it didn&#39;t affect my lungs. My last run was in the afternoon when warmer, but the cold air affected my lungs.)</p>\n<p>3.1: Your optimal strides aren&#39;t the small steps you take that are easy when you are tired. Each of those individual small steps may be easier to do, but the overall run will require more energy. Your optimal stride is different for everybody. It takes experience and practice to find, but you will greatly benefit after finding it. Metaphor: This is kinda like the fuel efficiency of your car, you have to be moving more to get better efficiency.</p>\n<p>3.2: Running is an activity that uses more than just your legs. You run best with synchronized legs, arms, core, hip, feet, calves, and mind. The one thing that many people don&#39;t pay attention to enough is the calf. For many people the calf does pretty much nothing. If you can activate your calves every step, then your stride length will be improved.</p>\n<p>3.3: There is a certain place your feet should be hitting the ground relative to your body. To scientifically lose the least amount of energy (also forward momentum), your foot should be striking the ground directly below your body. When the average person strikes their foot on the ground in front of their body, they are momentarily pushing backwards relative to forward motion, thus energy is wasted when people run like that. This is another reason why the optimal stride is not the longest step that you can take.</p>\n<ol start=\"4\">\n<li>Science!</li>\n</ol>\n","title":"Run Technique","file":"2014-03-24-run-technique.md","date":"2014-03-24","slug":"2014-03-24-run-technique"}